#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: a6f25a667a1bdcf454910f10e2cfe5f9.pdb
; shader hash: a6f25a667a1bdcf454910f10e2cfe5f9
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer GenerateMipsCB
; {
;
;   struct GenerateMipsCB
;   {
;
;       uint SrcMipLevel;                             ; Offset:    0
;       uint NumMipLevels;                            ; Offset:    4
;       uint SrcDimension;                            ; Offset:    8
;       uint Padding;                                 ; Offset:   12
;       float2 TexelSize;                             ; Offset:   16
;   
;   } GenerateMipsCB;                                 ; Offset:    0 Size:    24
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; GenerateMipsCB                    cbuffer      NA          NA     CB0            cb0     1
; LinearClampSampler                sampler      NA          NA      S0             s0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !53)
!1 = !DIFile(filename: "..\5Cshaders\5CGenerateMips_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 105, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 105, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 105, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 35, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 35, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!13, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!23 = !{!24, !44, !47, !50}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 103, type: !25, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !1, line: 21, size: 320, align: 32, elements: !28)
!28 = !{!29, !40, !41, !42}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !27, file: !1, line: 23, baseType: !30, size: 96, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 68, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 68, size: 96, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 68, baseType: !34, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 68, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 68, baseType: !34, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!38, !39}
!38 = !DITemplateTypeParameter(name: "element", type: !34)
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !27, file: !1, line: 24, baseType: !30, size: 96, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !27, file: !1, line: 25, baseType: !30, size: 96, align: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !27, file: !1, line: 26, baseType: !43, size: 32, align: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 31, baseType: !34)
!44 = !DISubprogram(name: "PackColor", linkageName: "\01?PackColor@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 92, type: !45, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !4}
!47 = !DISubprogram(name: "StoreColor", linkageName: "\01?StoreColor@@YAXIV?$vector@M$03@@@Z", scope: !1, file: !1, line: 70, type: !48, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !43, !4}
!50 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 78, type: !51, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!4, !43}
!53 = !{!54, !56, !57, !58, !59, !61, !65, !66, !67, !68, !72, !74, !75, !76, !77}
!54 = !DIGlobalVariable(name: "SrcMipLevel", linkageName: "\01?SrcMipLevel@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 31, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!56 = !DIGlobalVariable(name: "NumMipLevels", linkageName: "\01?NumMipLevels@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 32, type: !55, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariable(name: "SrcDimension", linkageName: "\01?SrcDimension@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 33, type: !55, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariable(name: "Padding", linkageName: "\01?Padding@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 34, type: !55, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariable(name: "TexelSize", linkageName: "\01?TexelSize@GenerateMipsCB@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 35, type: !60, isLocal: false, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!61 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !1, line: 65, type: !62, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 64)
!65 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !1, line: 66, type: !62, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!66 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !1, line: 67, type: !62, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!67 = !DIGlobalVariable(name: "gs_A", linkageName: "\01?gs_A@@3PAMA", scope: !0, file: !1, line: 68, type: !62, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_A@@3PAMA")
!68 = !DIGlobalVariable(name: "SrcMip", linkageName: "\01?SrcMip@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 39, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 39, size: 160, align: 32, elements: !2, templateParams: !70)
!70 = !{!71}
!71 = !DITemplateTypeParameter(name: "element", type: !5)
!72 = !DIGlobalVariable(name: "OutMip1", linkageName: "\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 42, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 42, size: 128, align: 32, elements: !2, templateParams: !70)
