#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 0cc2b44af658a3fea234508190fe13ee.pdb
; shader hash: 0cc2b44af658a3fea234508190fe13ee
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer PanoToCubemapCB
; {
;
;   struct PanoToCubemapCB
;   {
;
;       struct struct.PanoToCubemap
;       {
;
;           uint CubemapSize;                         ; Offset:    0
;           uint FirstMip;                            ; Offset:    4
;           uint NumMips;                             ; Offset:    8
;       
;       } PanoToCubemapCB;                            ; Offset:    0
;
;   
;   } PanoToCubemapCB;                                ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; PanoToCubemapCB                   cbuffer      NA          NA     CB0            cb0     1
; LinearRepeatSampler               sampler      NA          NA      S0             s0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !42)
!1 = !DIFile(filename: "..\5Cshaders\5CPanoToCubemap_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 67, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 67, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 67, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 100, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 100, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 100, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !13}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 58, type: !33, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !1, line: 7, size: 320, align: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !35, file: !1, line: 9, baseType: !22, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !35, file: !1, line: 10, baseType: !22, size: 96, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !35, file: !1, line: 11, baseType: !22, size: 96, align: 32, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !35, file: !1, line: 12, baseType: !41, size: 32, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !26)
!42 = !{!43, !45, !54, !66, !68, !69, !70, !71, !72, !74}
!43 = !DIGlobalVariable(name: "InvPI", scope: !0, file: !1, line: 54, type: !44, isLocal: true, isDefinition: true, variable: float 0x3FD45F3060000000)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!45 = !DIGlobalVariable(name: "PanoToCubemapCB", linkageName: "\01?PanoToCubemapCB@@3U?$ConstantBuffer@UPanoToCubemap@@@@A", scope: !0, file: !1, line: 25, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PanoToCubemap>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !47)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "T", type: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanoToCubemap", file: !1, line: 15, size: 96, align: 32, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "CubemapSize", scope: !49, file: !1, line: 18, baseType: !41, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "FirstMip", scope: !49, file: !1, line: 20, baseType: !41, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "NumMips", scope: !49, file: !1, line: 22, baseType: !41, size: 32, align: 32, offset: 64)
!54 = !DIGlobalVariable(name: "SrcTexture", linkageName: "\01?SrcTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !55, isLocal: false, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 29, size: 160, align: 32, elements: !2, templateParams: !56)
!56 = !{!57}
!57 = !DITemplateTypeParameter(name: "element", type: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !59, templateParams: !64)
!59 = !{!60, !61, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !58, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !58, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !{!12, !65}
!65 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!66 = !DIGlobalVariable(name: "DstMip1", linkageName: "\01?DstMip1@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 32, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2DArray<vector<float, 4> >", file: !1, line: 32, size: 128, align: 32, elements: !2, templateParams: !56)
!68 = !DIGlobalVariable(name: "DstMip2", linkageName: "\01?DstMip2@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 33, type: !67, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "DstMip3", linkageName: "\01?DstMip3@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 34, type: !67, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "DstMip4", linkageName: "\01?DstMip4@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 35, type: !67, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "DstMip5", linkageName: "\01?DstMip5@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 36, type: !67, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !1, line: 39, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 39, size: 32, align: 32, elements: !2)
!74 = !DIGlobalVariable(name: "InvPI", scope: !0, file: !1, line: 54, type: !44, isLocal: true, isDefinition: true)
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
