#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 494ad2c479c8e0059b8c44bd45149f93.pdb
; shader hash: 494ad2c479c8e0059b8c44bd45149f93
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer IrradianceConvolutionCB
; {
;
;   struct IrradianceConvolutionCB
;   {
;
;       struct struct.IrradianceConvolution
;       {
;
;           uint CubemapSize;                         ; Offset:    0
;       
;       } IrradianceConvolutionCB;                    ; Offset:    0
;
;   
;   } IrradianceConvolutionCB;                        ; Offset:    0 Size:     4
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; IrradianceConvolutionCB           cbuffer      NA          NA     CB0            cb0     1
; LinearRepeatSampler               sampler      NA          NA      S0             s0     1
; SrcTexture                        texture     f32        cube      T0             t0     1
; DstTexture                            UAV     f32     2darray      U0             u0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !64)
!1 = !DIFile(filename: "..\5Cshaders\5CIrradianceConvolution_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 90, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 90, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 90, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 90, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 121, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 121, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 121, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 51, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 51, size: 288, align: 32, elements: !26, templateParams: !36)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !25, file: !1, line: 51, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!36 = !{!12, !37, !38}
!37 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!38 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!39 = !{!40, !59, !62}
!40 = !DISubprogram(name: "main", scope: !1, file: !1, line: 80, type: !41, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !1, line: 7, size: 320, align: 32, elements: !44)
!44 = !{!45, !55, !56, !57}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !43, file: !1, line: 9, baseType: !46, size: 96, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !48, templateParams: !53)
!48 = !{!49, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !47, file: !1, baseType: !50, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !47, file: !1, baseType: !50, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !47, file: !1, baseType: !50, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !{!54, !13}
!54 = !DITemplateTypeParameter(name: "element", type: !50)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !43, file: !1, line: 10, baseType: !46, size: 96, align: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !43, file: !1, line: 11, baseType: !46, size: 96, align: 32, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !43, file: !1, line: 12, baseType: !58, size: 32, align: 32, offset: 288)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !50)
!59 = !DISubprogram(name: "??__ERotateUV@@YAXXZ", scope: !1, file: !1, line: 49, type: !60, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{null}
!62 = !DISubprogram(linkageName: "_GLOBAL__sub_I_IrradianceConvolution_CS.hlsl", scope: !1, file: !1, type: !63, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!63 = !DISubroutineType(types: !2)
!64 = !{!65, !67, !74, !78, !80, !82, !83, !84, !93, !94, !96, !98}
!65 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 46, type: !66, isLocal: true, isDefinition: true, variable: float 0x400921FB60000000)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!67 = !DIGlobalVariable(name: "IrradianceConvolutionCB", linkageName: "\01?IrradianceConvolutionCB@@3U?$ConstantBuffer@UIrradianceConvolution@@@@A", scope: !0, file: !1, line: 20, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<IrradianceConvolution>", file: !1, line: 20, size: 32, align: 32, elements: !2, templateParams: !69)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "IrradianceConvolution", file: !1, line: 15, size: 32, align: 32, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CubemapSize", scope: !71, file: !1, line: 17, baseType: !58, size: 32, align: 32)
!74 = !DIGlobalVariable(name: "SrcTexture", linkageName: "\01?SrcTexture@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !76)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "element", type: !16)
!78 = !DIGlobalVariable(name: "DstTexture", linkageName: "\01?DstTexture@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2DArray<vector<float, 4> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !76)
!80 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !1, line: 28, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!82 = !DIGlobalVariable(name: "InvPI", scope: !0, file: !1, line: 43, type: !66, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariable(name: "Inv2PI", scope: !0, file: !1, line: 44, type: !66, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariable(name: "InvAtan", scope: !0, file: !1, line: 45, type: !85, isLocal: true, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 45, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 45, size: 64, align: 32, elements: !88, templateParams: !91)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !87, file: !1, line: 45, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !87, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!91 = !{!12, !92}
!92 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!93 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 46, type: !66, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariable(name: "InvAtan.1", linkageName: "InvAtan.1", scope: !0, file: !1, line: 45, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !85, size: 32, align: 4, offset: 32)
!96 = !DIGlobalVariable(name: "InvAtan.0", linkageName: "InvAtan.0", scope: !0, file: !1, line: 45, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !85, size: 32, align: 4)
!98 = !DIGlobalVariable(name: "RotateUV", linkageName: "RotateUV.v.v.1dim", scope: !0, file: !1, line: 49, type: !99, isLocal: false, isDefinition: true, variable: [54 x float]* @RotateUV.v.v.1dim)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1728, align: 32, elements: !101)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!101 = !{!102}
!102 = !DISubrange(count: 6)
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
