#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e85e3c8986f5bd26ed61bac3f58a36f0.pdb
; shader hash: e85e3c8986f5bd26ed61bac3f58a36f0
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer PanoToCubemapCB
; {
;
;   struct PanoToCubemapCB
;   {
;
;       struct struct.PanoToCubemap
;       {
;
;           uint CubemapSize;                         ; Offset:    0
;           uint FirstMip;                            ; Offset:    4
;           uint NumMips;                             ; Offset:    8
;       
;       } PanoToCubemapCB;                            ; Offset:    0
;
;   
;   } PanoToCubemapCB;                                ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; PanoToCubemapCB                   cbuffer      NA          NA     CB0            cb0     1
; LinearRepeatSampler               sampler      NA          NA      S0             s0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !62)
!1 = !DIFile(filename: "..\5Cshaders\5CPanoToCubemap_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !22, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 98, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 98, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 98, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 98, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 98, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 105, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 105, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 105, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !13}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 61, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 61, size: 288, align: 32, elements: !33, templateParams: !43)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!43 = !{!12, !44, !45}
!44 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!45 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!46 = !{!47, !57, !60}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 88, type: !48, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !1, line: 7, size: 320, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !50, file: !1, line: 9, baseType: !22, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !50, file: !1, line: 10, baseType: !22, size: 96, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !50, file: !1, line: 11, baseType: !22, size: 96, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !50, file: !1, line: 12, baseType: !56, size: 32, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !26)
!57 = !DISubprogram(name: "??__ERotateUV@@YAXXZ", scope: !1, file: !1, line: 59, type: !58, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{null}
!60 = !DISubprogram(linkageName: "_GLOBAL__sub_I_PanoToCubemap_CS.hlsl", scope: !1, file: !1, type: !61, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!61 = !DISubroutineType(types: !2)
!62 = !{!63, !72, !84, !86, !87, !88, !89, !90, !92, !94, !95, !97, !99, !101}
!63 = !DIGlobalVariable(name: "PanoToCubemapCB", linkageName: "\01?PanoToCubemapCB@@3U?$ConstantBuffer@UPanoToCubemap@@@@A", scope: !0, file: !1, line: 25, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PanoToCubemap>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "T", type: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanoToCubemap", file: !1, line: 15, size: 96, align: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CubemapSize", scope: !67, file: !1, line: 18, baseType: !56, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "FirstMip", scope: !67, file: !1, line: 20, baseType: !56, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "NumMips", scope: !67, file: !1, line: 22, baseType: !56, size: 32, align: 32, offset: 64)
!72 = !DIGlobalVariable(name: "SrcTexture", linkageName: "\01?SrcTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 29, size: 160, align: 32, elements: !2, templateParams: !74)
!74 = !{!75}
!75 = !DITemplateTypeParameter(name: "element", type: !76)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !77, templateParams: !82)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !76, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !76, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !76, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !76, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!82 = !{!12, !83}
!83 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!84 = !DIGlobalVariable(name: "DstMip1", linkageName: "\01?DstMip1@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 32, type: !85, isLocal: false, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2DArray<vector<float, 4> >", file: !1, line: 32, size: 128, align: 32, elements: !2, templateParams: !74)
!86 = !DIGlobalVariable(name: "DstMip2", linkageName: "\01?DstMip2@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 33, type: !85, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "DstMip3", linkageName: "\01?DstMip3@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 34, type: !85, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "DstMip4", linkageName: "\01?DstMip4@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 35, type: !85, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "DstMip5", linkageName: "\01?DstMip5@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 36, type: !85, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !1, line: 39, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 39, size: 32, align: 32, elements: !2)
!92 = !DIGlobalVariable(name: "InvPI", scope: !0, file: !1, line: 54, type: !93, isLocal: true, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!94 = !DIGlobalVariable(name: "Inv2PI", scope: !0, file: !1, line: 55, type: !93, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "InvAtan", scope: !0, file: !1, line: 56, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!97 = !DIGlobalVariable(name: "InvAtan.1", linkageName: "InvAtan.1", scope: !0, file: !1, line: 56, type: !98, isLocal: false, isDefinition: true)
!98 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !96, size: 32, align: 4, offset: 32)
!99 = !DIGlobalVariable(name: "InvAtan.0", linkageName: "InvAtan.0", scope: !0, file: !1, line: 56, type: !100, isLocal: false, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !96, size: 32, align: 4)
!101 = !DIGlobalVariable(name: "RotateUV", linkageName: "RotateUV.v.v.1dim", scope: !0, file: !1, line: 59, type: !102, isLocal: false, isDefinition: true, variable: [54 x float]* @RotateUV.v.v.1dim)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 1728, align: 32, elements: !104)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!104 = !{!105}
!105 = !DISubrange(count: 6)
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
