#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 85ea43040a02fdd8b54c359a3cdacc1b.pdb
; shader hash: 85ea43040a02fdd8b54c359a3cdacc1b
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer PreFilterCB
; {
;
;   struct PreFilterCB
;   {
;
;       struct struct.PreFilter
;       {
;
;           uint CubemapSize;                         ; Offset:    0
;       
;       } PreFilterCB;                                ; Offset:    0
;
;   
;   } PreFilterCB;                                    ; Offset:    0 Size:     4
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; PreFilterCB                       cbuffer      NA          NA     CB0            cb0     1
; LinearRepeatSampler               sampler      NA          NA      S0             s0     1
; SrcTexture                        texture     f32        cube      T0             t0     1
; DstMip1                               UAV     f32     2darray      U0             u0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !86)
!1 = !DIFile(filename: "..\5Cshaders\5CPreFilter_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !30, !39}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 186, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 186, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 186, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 186, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 186, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 52, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 52, size: 288, align: 32, elements: !17, templateParams: !27)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !16, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!27 = !{!12, !28, !29}
!28 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!29 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 50, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 21, size: 128, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !31, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !{!12, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 46, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 46, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 46, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 46, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!12, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!46 = !{!47, !66, !69, !72, !75, !78, !81, !84}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 176, type: !48, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !1, line: 4, size: 320, align: 32, elements: !51)
!51 = !{!52, !62, !63, !64}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !50, file: !1, line: 6, baseType: !53, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !55, templateParams: !60)
!55 = !{!56, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, baseType: !57, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, baseType: !57, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !54, file: !1, baseType: !57, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !{!61, !13}
!61 = !DITemplateTypeParameter(name: "element", type: !57)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !50, file: !1, line: 7, baseType: !53, size: 96, align: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !50, file: !1, line: 8, baseType: !53, size: 96, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !50, file: !1, line: 9, baseType: !65, size: 32, align: 32, offset: 288)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !57)
!66 = !DISubprogram(name: "??__ERotateUV@@YAXXZ", scope: !1, file: !1, line: 50, type: !67, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{null}
!69 = !DISubprogram(name: "PreFilterSampler", linkageName: "\01?PreFilterSampler@@YA?AV?$vector@M$03@@MV?$vector@M$02@@0@Z", scope: !1, file: !1, line: 134, type: !70, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!30, !8, !4, !4}
!72 = !DISubprogram(name: "Hammersley", linkageName: "\01?Hammersley@@YA?AV?$vector@M$01@@II@Z", scope: !1, file: !1, line: 104, type: !73, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!39, !65, !65}
!75 = !DISubprogram(name: "RadicalInverse_VdC", linkageName: "\01?RadicalInverse_VdC@@YAMI@Z", scope: !1, file: !1, line: 94, type: !76, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!8, !65}
!78 = !DISubprogram(name: "ImportanceSampleGGX", linkageName: "\01?ImportanceSampleGGX@@YA?AV?$vector@M$02@@V?$vector@M$01@@V1@M@Z", scope: !1, file: !1, line: 109, type: !79, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!4, !39, !4, !8}
!81 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !1, file: !1, line: 78, type: !82, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!8, !4, !4, !8}
!84 = !DISubprogram(linkageName: "_GLOBAL__sub_I_PreFilter_CS.hlsl", scope: !1, file: !1, type: !85, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!85 = !DISubroutineType(types: !2)
!86 = !{!87, !94, !98, !100, !101, !102, !103, !104, !106, !108, !109, !111, !112, !114, !116, !118}
!87 = !DIGlobalVariable(name: "PreFilterCB", linkageName: "\01?PreFilterCB@@3U?$ConstantBuffer@UPreFilter@@@@A", scope: !0, file: !1, line: 19, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PreFilter>", file: !1, line: 19, size: 32, align: 32, elements: !2, templateParams: !89)
!89 = !{!90}
!90 = !DITemplateTypeParameter(name: "T", type: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PreFilter", file: !1, line: 12, size: 32, align: 32, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "CubemapSize", scope: !91, file: !1, line: 15, baseType: !65, size: 32, align: 32)
!94 = !DIGlobalVariable(name: "SrcTexture", linkageName: "\01?SrcTexture@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 21, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 21, size: 128, align: 32, elements: !2, templateParams: !96)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "element", type: !31)
!98 = !DIGlobalVariable(name: "DstMip1", linkageName: "\01?DstMip1@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 23, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2DArray<vector<float, 4> >", file: !1, line: 23, size: 128, align: 32, elements: !2, templateParams: !96)
!100 = !DIGlobalVariable(name: "DstMip2", linkageName: "\01?DstMip2@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 24, type: !99, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "DstMip3", linkageName: "\01?DstMip3@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !99, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "DstMip4", linkageName: "\01?DstMip4@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 26, type: !99, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "DstMip5", linkageName: "\01?DstMip5@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !99, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !1, line: 29, type: !105, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 29, size: 32, align: 32, elements: !2)
!106 = !DIGlobalVariable(name: "InvPI", scope: !0, file: !1, line: 44, type: !107, isLocal: true, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!108 = !DIGlobalVariable(name: "Inv2PI", scope: !0, file: !1, line: 45, type: !107, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariable(name: "InvAtan", scope: !0, file: !1, line: 46, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!111 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 47, type: !107, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariable(name: "SAMPLE_COUNT", scope: !69, file: !1, line: 137, type: !113, isLocal: true, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!114 = !DIGlobalVariable(name: "InvAtan.1", linkageName: "InvAtan.1", scope: !0, file: !1, line: 46, type: !115, isLocal: false, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !110, size: 32, align: 4, offset: 32)
!116 = !DIGlobalVariable(name: "InvAtan.0", linkageName: "InvAtan.0", scope: !0, file: !1, line: 46, type: !117, isLocal: false, isDefinition: true)
!117 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !110, size: 32, align: 4)
!118 = !DIGlobalVariable(name: "RotateUV", linkageName: "RotateUV.v.v.1dim", scope: !0, file: !1, line: 50, type: !119, isLocal: false, isDefinition: true, variable: [54 x float]* @RotateUV.v.v.1dim)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 1728, align: 32, elements: !121)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !{i32 2, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
